results/k6-flash-rerun.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: cart-stress-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m15s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 45s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 010/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 010/100 VUs  01.0s/45.0s

running (0m02.0s), 020/100 VUs, 10 complete and 0 interrupted iterations
default   [   4% ] 020/100 VUs  02.0s/45.0s

running (0m03.0s), 030/100 VUs, 30 complete and 0 interrupted iterations
default   [   7% ] 030/100 VUs  03.0s/45.0s

running (0m04.0s), 040/100 VUs, 60 complete and 0 interrupted iterations
default   [   9% ] 040/100 VUs  04.0s/45.0s

running (0m05.0s), 050/100 VUs, 100 complete and 0 interrupted iterations
default   [  11% ] 050/100 VUs  05.0s/45.0s

running (0m06.0s), 060/100 VUs, 150 complete and 0 interrupted iterations
default   [  13% ] 060/100 VUs  06.0s/45.0s

running (0m07.0s), 070/100 VUs, 209 complete and 0 interrupted iterations
default   [  16% ] 070/100 VUs  07.0s/45.0s

running (0m08.0s), 080/100 VUs, 273 complete and 0 interrupted iterations
default   [  18% ] 080/100 VUs  08.0s/45.0s

running (0m09.0s), 089/100 VUs, 352 complete and 0 interrupted iterations
default   [  20% ] 089/100 VUs  09.0s/45.0s

running (0m10.0s), 099/100 VUs, 441 complete and 0 interrupted iterations
default   [  22% ] 099/100 VUs  10.0s/45.0s

running (0m11.0s), 100/100 VUs, 540 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  11.0s/45.0s

running (0m12.0s), 100/100 VUs, 640 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  12.0s/45.0s

running (0m13.0s), 100/100 VUs, 740 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  13.0s/45.0s

running (0m14.0s), 100/100 VUs, 840 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  14.0s/45.0s

running (0m15.0s), 100/100 VUs, 940 complete and 0 interrupted iterations
default   [  33% ] 100/100 VUs  15.0s/45.0s

running (0m16.0s), 100/100 VUs, 1036 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  16.0s/45.0s

running (0m17.0s), 100/100 VUs, 1133 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  17.0s/45.0s

running (0m18.0s), 100/100 VUs, 1230 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  18.0s/45.0s

running (0m19.0s), 100/100 VUs, 1330 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  19.0s/45.0s

running (0m20.0s), 100/100 VUs, 1430 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  20.0s/45.0s

running (0m21.0s), 100/100 VUs, 1530 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  21.0s/45.0s

running (0m22.0s), 100/100 VUs, 1630 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  22.0s/45.0s

running (0m23.0s), 100/100 VUs, 1730 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  23.0s/45.0s

running (0m24.0s), 100/100 VUs, 1830 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  24.0s/45.0s

running (0m25.0s), 100/100 VUs, 1930 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  25.0s/45.0s

running (0m26.0s), 100/100 VUs, 2028 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  26.0s/45.0s

running (0m27.0s), 100/100 VUs, 2122 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  27.0s/45.0s

running (0m28.0s), 100/100 VUs, 2220 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  28.0s/45.0s

running (0m29.0s), 100/100 VUs, 2320 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  29.0s/45.0s

running (0m30.0s), 100/100 VUs, 2420 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  30.0s/45.0s

running (0m31.0s), 100/100 VUs, 2520 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  31.0s/45.0s

running (0m32.0s), 100/100 VUs, 2620 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  32.0s/45.0s

running (0m33.0s), 100/100 VUs, 2720 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  33.0s/45.0s

running (0m34.0s), 100/100 VUs, 2820 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  34.0s/45.0s

running (0m35.0s), 100/100 VUs, 2919 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  35.0s/45.0s

running (0m36.0s), 100/100 VUs, 3011 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  36.0s/45.0s

running (0m37.0s), 100/100 VUs, 3110 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  37.0s/45.0s

running (0m38.0s), 100/100 VUs, 3209 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  38.0s/45.0s

running (0m39.0s), 100/100 VUs, 3309 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  39.0s/45.0s

running (0m40.0s), 100/100 VUs, 3409 complete and 0 interrupted iterations
default   [  89% ] 100/100 VUs  40.0s/45.0s

running (0m41.0s), 091/100 VUs, 3509 complete and 0 interrupted iterations
default   [  91% ] 091/100 VUs  41.0s/45.0s

running (0m42.0s), 071/100 VUs, 3600 complete and 0 interrupted iterations
default   [  93% ] 071/100 VUs  42.0s/45.0s

running (0m43.0s), 051/100 VUs, 3671 complete and 0 interrupted iterations
default   [  96% ] 051/100 VUs  43.0s/45.0s

running (0m44.0s), 031/100 VUs, 3722 complete and 0 interrupted iterations
default   [  98% ] 031/100 VUs  44.0s/45.0s

running (0m45.0s), 010/100 VUs, 3753 complete and 0 interrupted iterations
default   [ 100% ] 010/100 VUs  45.0s/45.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<2000' p(95)=12.78ms

    status_500
    ✓ 'count<5' count=0


  █ TOTAL RESULTS 

    checks_total.......: 7526    164.4538/s
    checks_succeeded...: 100.00% 7526 out of 7526
    checks_failed......: 0.00%   0 out of 7526

    ✓ no server errors
    ✓ valid status

    CUSTOM
    response_time_ms...............: avg=9.691401 min=4.963201 med=9.322096 max=156.76581 p(90)=11.82528 p(95)=12.783307
    status_200.....................: 3763   82.2269/s
    status_500.....................: 0      0/s

    HTTP
    http_req_duration..............: avg=9.69ms   min=4.96ms   med=9.32ms   max=156.76ms  p(90)=11.82ms  p(95)=12.78ms  
      { expected_response:true }...: avg=9.69ms   min=4.96ms   med=9.32ms   max=156.76ms  p(90)=11.82ms  p(95)=12.78ms  
    http_req_failed................: 0.00%  0 out of 3763
    http_reqs......................: 3763   82.2269/s

    EXECUTION
    iteration_duration.............: avg=1.01s    min=1s       med=1.01s    max=1.15s     p(90)=1.01s    p(95)=1.01s    
    iterations.....................: 3763   82.2269/s
    vus............................: 10     min=10        max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 2.4 MB 53 kB/s
    data_sent......................: 2.0 MB 43 kB/s



running (0m45.8s), 000/100 VUs, 3763 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  45s